doom/.config/doom/config.org
#+title:  MSantana's Literate Doom Configuration
#+author: MSantana
#+email:  msantana@example.com
#+language: en
#+property: header-args :tangle config.el
#+description: A highly polished, aesthetic configuration for Pop!_OS.

* Table of Contents :TOC:
- [[#identity][Identity]]
- [[#visual-aesthetics][Visual Aesthetics]]
  - [[#theme--transparency][Theme & Transparency]]
  - [[#typography][Typography]]
  - [[#window-management][Window Management]]
- [[#org-mode-perfection][Org Mode Perfection]]
  - [[#pretty-bullets--headers][Pretty Bullets & Headers]]
  - [[#modern-look][Modern Look]]
- [[#markdown-styling][Markdown Styling]]
- [[#obsidian-integration][Obsidian Integration]]
- [[#writing-experience][Writing Experience]]
- [[#typst-ide][Typst IDE]]
  - [[#typography-for-typst][Typography for Typst]]
  - [[#lsp-and-real-time-preview][LSP and Real-time Preview]]
- [[#custom-packages][Custom Packages]]
- [[#clojure-ide][Clojure IDE]]

* Identity
Identifying information for GPG and other services.

#+begin_src elisp
(setq user-full-name "MSantana"
      user-mail-address "msantana@example.com")
#+end_src

* Visual Aesthetics
I want my editor to look as good as Pop!_OS.

** Theme & Transparency
=doom-one= is a classic, but let's make it feel more integrated.

#+begin_src elisp
(setq doom-theme 'doom-one)

;; Add some subtle transparency if using a compositor (like Pop!_OS's default)
(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(add-to-list 'default-frame-alist '(alpha . (95 . 95)))
#+end_src

** Typography
Using the high-quality Nerd Fonts found on the system.
- *Main Font:* FiraCode (Great ligatures)
- *Variable Pitch:* CaskaydiaCove (Excellent for prose)

#+begin_src elisp
(setq doom-font (font-spec :family "FiraCode Nerd Font" :size 14 :weight 'medium)
      doom-variable-pitch-font (font-spec :family "CaskaydiaCove Nerd Font Propo" :size 15)
      doom-big-font (font-spec :family "FiraCode Nerd Font" :size 20))

;; Enable ligatures
(setq +ligatures-in-modes '(org-mode markdown-mode emacs-lisp-mode web-mode javascript-mode ruby-mode))
#+end_src

** Window Management
#+begin_src elisp
(setq display-line-numbers-type 'relative) ; More efficient for Vim users
#+end_src

* Org Mode Perfection
Org mode should look like a beautiful document, not a spreadsheet.

** Pretty Bullets & Headers
#+begin_src elisp
(after! org
  (setq org-directory "~/org/"
        org-ellipsis " ▾ "
        org-hide-emphasis-markers t
        org-log-done 'time
        org-hide-leading-stars t
        org-priority-faces
        '((?A . error)
          (?B . warning)
          (?C . success)))

  ;; Customizing header sizes
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.4 :weight bold))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.3 :weight bold))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.2 :weight semi-bold))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.1 :weight semi-bold)))))

  ;; Use variable pitch for prose in Org
  (add-hook 'org-mode-hook #'mixed-pitch-mode))
#+end_src

** Modern Look
#+begin_src elisp
(use-package! org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq org-modern-star '("◉" "○" "◈" "◇" "✳")
        org-modern-list '((?+ . "•") (?- . "–"))))
#+end_src

* Markdown Styling
#+begin_src elisp
(after! markdown-mode
  (setq markdown-header-scaling t
        markdown-header-scaling-values '(1.4 1.3 1.2 1.1 1.0 1.0))
  (add-hook 'markdown-mode-hook #'mixed-pitch-mode))
#+end_src

* Obsidian Integration
Configuration for working with Obsidian vaults.

#+begin_src elisp
(use-package! obsidian
  :ensure t
  :demand t
  :config
  (setq obsidian-directory "~/Notes")

  ;; Note: You might want to define some keybindings
  (map! :map obsidian-mode-map
        :localleader
        :desc "Insert link" "l" #'obsidian-insert-link
        :desc "Insert wikilink" "w" #'obsidian-insert-wikilink
        :desc "Follow link" "f" #'obsidian-follow-link-at-point
        :desc "Backlinks" "b" #'obsidian-backlink-show
        :desc "Search vault" "s" #'obsidian-search
        :desc "Daily note" "d" #'obsidian-today)

  ;; Global keybindings for quick access
  (map! :leader
        (:prefix ("n" . "notes")
         (:prefix ("O" . "obsidian")
          :desc "Open vault" "o" (cmd! (find-file obsidian-directory))
          :desc "Search vault" "s" #'obsidian-search
          :desc "Daily note" "d" #'obsidian-today
          :desc "Capture note" "c" #'obsidian-capture))))

;; Ensure obsidian-mode is enabled for files in your vault
(add-hook 'markdown-mode-hook
          (lambda ()
            (when (and (buffer-file-name)
                       (string-prefix-p (expand-file-name obsidian-directory)
                                        (expand-file-name (buffer-file-name))))
              (obsidian-mode 1))))
#+end_src

* Writing Experience
Settings to make typing more pleasant.

#+begin_src elisp
(setq-default line-spacing 0.12)
(setq confirm-kill-emacs #'yes-or-no-p)
#+end_src

* Typst IDE
A modern markup-based typesetting system, configured as a complete IDE.

** Typography for Typst
Typst files should look as good as your Org files.

#+begin_src elisp
(after! typst-ts-mode
  (add-hook 'typst-ts-mode-hook #'mixed-pitch-mode)
  (add-hook 'typst-ts-mode-hook #'outline-minor-mode))

(add-to-list 'auto-mode-alist '("\\.typ\\'" . typst-ts-mode))
#+end_src

** LSP and Real-time Preview
Using =typst-lsp= for completions and =typst-preview= for immediate visual feedback.

#+begin_src elisp
(after! typst-ts-mode
  (setq typst-ts-mode-watch-options "--open")
  
  (map! :map typst-ts-mode-map
        :localleader
        :desc "Preview" "p" #'typst-preview
        :desc "Compile" "c" #'typst-ts-mode-compile
        :desc "Watch"   "w" #'typst-ts-mode-watch))

(after! typst-preview
  (setq typst-preview-browser "firefox") ; or "google-chrome", "chromium", etc.
  (setq typst-preview-args '("--listen" "127.0.0.1:9876")))
#+end_src

* Custom Packages

* Clojure IDE
A comprehensive configuration for Clojure and ClojureScript development.

#+begin_src elisp
(after! clojure-mode
  ;; Enable paredit for powerful structural editing
  (add-hook 'clojure-mode-hook #'enable-paredit-mode)

  ;; Keybindings for common actions
  (map! :map clojure-mode-map
        :localleader
        :desc "Format buffer" "f" #'+format/buffer
        :desc "Jack-in" "j" #'cider-jack-in
        :desc "Connect to REPL" "c" #'cider-connect
        :desc "Load current file" "l" #'cider-load-file
        :desc "Run tests" "t" #'cider-test-run-ns-tests))

(after! cider
  ;; Display function signatures and documentation in the minibuffer
  (setq cider-use-eldoc-for-symbol-completion t)
  
  ;; When a warning is reported, open a buffer with the details
  (setq cider-show-error-buffer-on-warning t)
  
  ;; Automatically pretty-print REPL output
  (setq cider-repl-use-pretty-printing t))

(after! lsp-mode
  ;; Optional: If you want to customize lsp-ui for a cleaner look
  (setq lsp-ui-sideline-show-diagnostics t
        lsp-ui-doc-show-with-mouse nil
        lsp-ui-sideline-show-code-actions nil))

;; To configure formatting, create a `.cljstyle.clj` file in your project's
;; root directory. clojure-lsp will automatically pick it up.
;; Example `.cljstyle.clj`:.
;;
;; {
;;  :remove-consecutive-blank-lines? false
;;  :indentation {:list-defs {\"def.*\" [[:inner 0]]}}
;; }
;;
;; For more options, see the cljstyle documentation.
#+end_src
